# 교통수단(버스, 지하철) 최종 테이블

In [1]:
import pandas as pd

In [2]:
# 전처리된 데이터 불러오기
bus = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/bus_info.xlsx')
subway = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/subway_info.xlsx')

In [3]:
# 버스 정류장 데이터
bus.info()
bus.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34546 entries, 0 to 34545
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   34546 non-null  object
 1   정류소명(역명)  34546 non-null  object
 2   월평균승차수    33946 non-null  float64
 3   월평균하차수    33946 non-null  float64
 4   월평균승하차총계  33946 non-null  float64
 5   위도        34546 non-null  float64
 6   경도        34546 non-null  float64
dtypes: float64(5), object(2)
memory usage: 1.8+ MB

       node_id        정류소명(역명)  월평균승차수  월평균하차수  월평균승하차총계         위도         경도
0  BB100000001  종로2가사거리(00032)   335.0   329.0     664.0  37.569765  126.98775
1  BB100000001  종로2가사거리(00067)  7908.0  6621.0   14529.0  37.569765  126.98775

In [4]:
# 지하철 데이터
subway.info()
subway.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 401 entries, 0 to 400
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   401 non-null    object
 1   정류소명(역명)  401 non-null    object
 2   월평균승차수    260 non-null    float64
 3   월평균하차수    260 non-null    float64
 4   월평균승하차총계  260 non-null    float64
 5   위도        401 non-null    float64
 6   경도        401 non-null    float64
dtypes: float64(5), object(2)
memory usage: 22.1+ KB

  node_id 정류소명(역명)     월평균승차수      월평균하차수    월평균승하차총계         위도          경도
0    S150      서울역  1301736.5  1264329.75  2566066.25  37.556228  126.972135
1    S151       시청   625330.5   632575.33  1257905.83  37.565715  126.977088

In [5]:
# 데이터 합치기
df = pd.concat([bus, subway]).reset_index(drop=True)
print(bus.shape, subway.shape, df.shape)
df.tail(2)

(34546, 7) (401, 7) (34947, 7)

      node_id 정류소명(역명)  월평균승차수  월평균하차수  월평균승하차총계         위도          경도
34945   S1002       남영     NaN     NaN       NaN  37.541021  126.971300
34946   S1001      서울역     NaN     NaN       NaN  37.554337  126.971134

In [6]:
df.to_excel('transport_info.xlsx', index=False)